circircir-circle/human_exist_device/ESP32_LD2410/src/main.cpp
  if (deviceConnected)
  {
    //        pTxCharacteristic->setValue(&txValue, 1);
    //        pTxCharacteristic->notify();
    //        txValue++;
    //    delay(10); // bluetooth stack will go into congestion, if too many packets are sent
    for (int i = 0; i < 9; i++)
    {
      txbuf[i] = read_buf[t_s + i];
      txbuf[9 + i] = read_buf[s_s + i];
    }
    pLD2410_StatusCharacteristic->setValue(txbuf, 18);
    pLD2410_StatusCharacteristic->notify();
//    Serial.printf("sent: ", txbuf);
//    for (int i = 0; i < 18; i++)
//    {
//      Serial.printf("0x%02x ", txbuf[i]);
//    }
//    Serial.println(" ");  
    pLD2410_ResultCharacteristic->setValue(LD2410_result, sizeof(LD2410_result));
    pLD2410_ResultCharacteristic->notify();
  }
  // disconnecting
  if (!deviceConnected && oldDeviceConnected)
  {
  }
  // connecting
  if (deviceConnected && !oldDeviceConnected)
  {
    // do stuff here on connecting
    
  }
};

void MqttRecvCallback(char *topic, byte *payload, unsigned int length)
{
  Serial.print("Message arrived in topic: ");
  Serial.println(topic);
  Serial.print("Message:");
  for (int i = 0; i < length; i++)
  {
    Serial.print((char)payload[i]);
  }
  Serial.println();
  Serial.println("-----------------------");
};

int StartWifiMqtt()
{
  int i = 0;
  const int limit_i = 10;
  updata_data_from_nvs();

  // 打开 wifi, 等待2s看能否连接, 如果不能连接, 则退出该函数
//  WiFi.mode(WIFI_STA);
  i = wifi_ssid.compareTo("");
  Serial.printf("wifi_ssid equal NULL? = %d\n\r", i);
  if (i) {
    Serial.printf("start wifi  ssid = %s   pwd = %s\n\r", wifi_ssid.c_str(), wifi_pwd.c_str());
    WiFi.begin(wifi_ssid.c_str(), wifi_pwd.c_str());
  }

  i = 0;
  NetState[0] = 0;
  NetState[1] = 0;
  updata_BLE_Net_State();
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(1000);
    Serial.println("Connectingto WiFi..");
    if (i++ == limit_i)
    {
      Serial.println("Connect WiFi failed..");
      NetState[0] = 0;
      NetState[1] = 0;
      updata_BLE_Net_State();
      return -1;   // 连接 wifi 失败
    }
  }
  if (i == (limit_i + 1))
  {
    Serial.println("break start wifi_mqtt progress");
  }

  // 假设成功连接, 则尝试连接mqtt服务器, 5s没有连上, 则退出
  NetState[0] = 1;  
  updata_BLE_Net_State();
  Serial.printf("%d: Connected to the WiFi network\n\r", i);
  mqttclient.disconnect();
  mqttclient.setServer(mqtt_site.c_str(), mqtt_port);
//  mqttclient.setKeepAlive(mqtt_period * 2);
  mqttclient.setCallback(MqttRecvCallback);
  i= 0;
  while (!mqttclient.connected())
  {
    char name[100];
    Serial.println("Connecting to MQTT...");
    sprintf(name, "ESP32HM-%s", chipId);
    if (mqttclient.connect(name, mqtt_account.c_str(), mqtt_pwd.c_str()))
    {
      Serial.println("connected");
    }
    else
    {
      Serial.print("failed with state ");
      Serial.print(mqttclient.state());
      delay(1000);
      if (i++ == 5)
      {
        Serial.println("connect to mqtt server failed, break the progress");
        return -2;   // 连接 mqtt 失败
      }
    }
  }

  if (mqttclient.connected())
  {
    NetState[1] = 1;
    updata_BLE_Net_State();
    mqttclient.subscribe("ESP32/ESP32_human_exist/set");
  } 
  
  return 0;
};


void restCallback(TimerHandle_t xTimer ) 
{ //长时间不访问蓝牙将停掉蓝牙
  resr_count_down --;
  Serial.print("resr_count_down: ");
  Serial.println(resr_count_down);
};



void initBLE()
{  
  //!---------- 以下将设置并开启蓝牙
  // Create the BLE Device
  char name[100];
  sprintf(name, "HMConfigWifi-ID%s", chipId);
  BLEDevice::init(name);

  // Create the BLE Server
  pServer = BLEDevice::createServer();
  pServer->setCallbacks(new MyServerCallbacks());

  // Create the BLE Service
  pService_wifi = pServer->createService(SERVICE_UUID_wifi);
  pService_LD2410 = pServer->createService(SERVICE_UUID_LD2410);

  // Create a BLE Characteristic
  pWifi_ssidCharacteristic = pService_wifi->createCharacteristic(
      CHARACTERISTIC_UUID_Wifi_ssid,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pWifi_ssidCharacteristic->setCallbacks(new MyCallbacksWifi_ssid());

  pWifi_PwdCharacteristic = pService_wifi->createCharacteristic(
      CHARACTERISTIC_UUID_Wifi_Pwd,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pWifi_PwdCharacteristic->setCallbacks(new MyCallbacksWifi_Pwd());

  pMQTT_SiteCharacteristic = pService_wifi->createCharacteristic(
      CHARACTERISTIC_UUID_MQTT_Site,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pMQTT_SiteCharacteristic->setCallbacks(new MyCallbacksMQTT_Site());

  pMQTT_portCharacteristic = pService_wifi->createCharacteristic(
      CHARACTERISTIC_UUID_MQTT_port,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pMQTT_portCharacteristic->setCallbacks(new MyCallbacksMQTT_port());

  pMQTT_AccountCharacteristic = pService_wifi->createCharacteristic(
      CHARACTERISTIC_UUID_MQTT_Account,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pMQTT_AccountCharacteristic->setCallbacks(new MyCallbacksMQTT_Account());

  pMQTT_pwdCharacteristic = pService_wifi->createCharacteristic(
      CHARACTERISTIC_UUID_MQTT_pwd,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pMQTT_pwdCharacteristic->setCallbacks(new MyCallbacksMQTT_pwd());

  pLD2410_ThCharacteristic = pService_LD2410->createCharacteristic(
      CHARACTERISTIC_UUID_LD2410_Th,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pLD2410_ThCharacteristic->setCallbacks(new MyCallbacksLD2410_Th());

  pLD2410_StatusCharacteristic = pService_LD2410->createCharacteristic(
      CHARACTERISTIC_UUID_LD2410_Status,
      BLECharacteristic::PROPERTY_NOTIFY);

  pNet_StatesCharacteristic = pService_LD2410->createCharacteristic(
      CHARACTERISTIC_UUID_Net_States,
      BLECharacteristic::PROPERTY_NOTIFY);

  pJudge_ParamsCharacteristic = pService_LD2410->createCharacteristic(
      CHARACTERISTIC_UUID_Judge_Params,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pJudge_ParamsCharacteristic->setCallbacks(new MyCallbacksJudge_Params());

  pSend_CMDCharacteristic = pService_LD2410->createCharacteristic(
      CHARACTERISTIC_UUID_Send_CMD,
      BLECharacteristic::PROPERTY_NOTIFY |  BLECharacteristic::PROPERTY_WRITE);
  pSend_CMDCharacteristic->setCallbacks(new MyCallbacksSend_CMD());

  pLD2410_ResultCharacteristic = pService_LD2410->createCharacteristic(
      CHARACTERISTIC_UUID_LD2410_Result,
      BLECharacteristic::PROPERTY_NOTIFY);


  // Start the service
  pService_wifi->start();
  pService_LD2410->start();

  // Start advertising
  pServer->getAdvertising()->start();
  ble_inited = 1;
  Serial.println("Waiting a client connection to notify...");
};

void updata_data_from_nvs(void)
{
  int ok;
  int i;
  wifi_ssid = preferences.getString ("wifi_ssid");
  Serial.printf("read wifi_ssid from NVS = %s\n\r", wifi_ssid);
  wifi_pwd = preferences.getString ("wifi_pwd");
  Serial.printf("read wifi_pwd from NVS = %s\n\r", wifi_pwd);
  mqtt_site = preferences.getString ("mqtt_site");
  Serial.printf("read mqtt_site from NVS = %s\n\r", mqtt_site);
  mqtt_port = preferences.getInt ("mqtt_port");
  Serial.printf("read mqtt_port from NVS = %d\n\r", mqtt_port);
  mqtt_account = preferences.getString ("mqtt_account");
  Serial.printf("read mqtt_account from NVS = %s\n\r", mqtt_account);
  mqtt_pwd = preferences.getString ("mqtt_pwd");  
  Serial.printf("read mqtt_pwd from NVS = %s\n\r", mqtt_pwd);
  
